-- Вставка основных категорий
INSERT INTO categories (name, is_service) VALUES
-- Категории товаров
('Электроника', false),
('Одежда и обувь', false),
('Дом и сад', false),
('Красота и здоровье', false),
('Спорт и отдых', false),
('Детские товары', false),
('Автотовары', false),
('Книги и канцелярия', false),
('Хобби и творчество', false),
('Животные', false),
-- Категории услуг
('Репетиторство', true),
('Образовательные услуги', true),
('Бытовые услуги', true),
('Ремонт и строительство', true),
('Красота и уход', true),
('Транспортные услуги', true),
('IT и компьютерные услуги', true),
('Мероприятия и развлечения', true),


-- Вставка подкатегорий для Электроника
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Смартфоны', 1, false),
                                                         ('Ноутбуки', 1, false),
                                                         ('Телевизоры', 1, false),
                                                         ('Наушники', 1, false),
                                                         ('Фотоаппараты', 1, false),
                                                         ('Игровые консоли', 1, false),
                                                         ('Умные часы', 1, false),
                                                         ('Планшеты', 1, false),
                                                         ('Компьютеры', 1, false),
                                                         ('Аксессуары', 1, false);

-- Вставка подкатегорий для Одежда и обувь
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Мужская одежда', 2, false),
                                                         ('Женская одежда', 2, false),
                                                         ('Детская одежда', 2, false),
                                                         ('Обувь', 2, false),
                                                         ('Аксессуары', 2, false),
                                                         ('Спортивная одежда', 2, false),
                                                         ('Верхняя одежда', 2, false),
                                                         ('Белье', 2, false),
                                                         ('Костюмы', 2, false),
                                                         ('Платья', 2, false);

-- Вставка подкатегорий для Дом и сад
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Мебель', 3, false),
                                                         ('Текстиль', 3, false),
                                                         ('Посуда', 3, false),
                                                         ('Бытовая техника', 3, false),
                                                         ('Инструменты', 3, false),
                                                         ('Садовая техника', 3, false),
                                                         ('Освещение', 3, false),
                                                         ('Декор', 3, false),
                                                         ('Хранение', 3, false),
                                                         ('Кухонные принадлежности', 3, false);

-- Вставка подкатегорий для Красота и здоровье
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Косметика', 4, false),
                                                         ('Парфюмерия', 4, false),
                                                         ('Уходовая косметика', 4, false),
                                                         ('БАДы', 4, false),
                                                         ('Аптечные товары', 4, false),
                                                         ('Гигиена', 4, false),
                                                         ('Волосы', 4, false),
                                                         ('Лицо', 4, false),
                                                         ('Тело', 4, false),
                                                         ('Маникюр', 4, false);

-- Вставка подкатегорий для Спорт и отдых
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Фитнес', 5, false),
                                                         ('Туризм', 5, false),
                                                         ('Велоспорт', 5, false),
                                                         ('Зимние виды', 5, false),
                                                         ('Водные виды', 5, false),
                                                         ('Игровые виды', 5, false),
                                                         ('Тренажеры', 5, false),
                                                         ('Спортивное питание', 5, false),
                                                         ('Одежда', 5, false),
                                                         ('Обувь', 5, false);

-- Вставка подкатегорий для Детские товары
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Одежда', 6, false),
                                                         ('Обувь', 6, false),
                                                         ('Игрушки', 6, false),
                                                         ('Коляски', 6, false),
                                                         ('Мебель', 6, false),
                                                         ('Питание', 6, false),
                                                         ('Гигиена', 6, false),
                                                         ('Творчество', 6, false),
                                                         ('Книги', 6, false),
                                                         ('Школа', 6, false);

-- Вставка подкатегорий для Автотовары
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Запчасти', 7, false),
                                                         ('Шины', 7, false),
                                                         ('Аккумуляторы', 7, false),
                                                         ('Масла', 7, false),
                                                         ('Автохимия', 7, false),
                                                         ('Аксессуары', 7, false),
                                                         ('Аудио', 7, false),
                                                         ('Безопасность', 7, false),
                                                         ('Уход', 7, false),
                                                         ('Инструменты', 7, false);

-- Вставка подкатегорий для Книги и канцелярия
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Художественная', 8, false),
                                                         ('Научная', 8, false),
                                                         ('Детская', 8, false),
                                                         ('Учебная', 8, false),
                                                         ('Канцелярия', 8, false),
                                                         ('Бумага', 8, false),
                                                         ('Письменные принадлежности', 8, false),
                                                         ('Офис', 8, false),
                                                         ('Творчество', 8, false),
                                                         ('Подарки', 8, false);

-- Вставка подкатегорий для Хобби и творчество
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Рукоделие', 9, false),
                                                         ('Рисование', 9, false),
                                                         ('Музыка', 9, false),
                                                         ('Фотография', 9, false),
                                                         ('Коллекционирование', 9, false),
                                                         ('Моделирование', 9, false),
                                                         ('Садоводство', 9, false),
                                                         ('Кулинария', 9, false),
                                                         ('Игры', 9, false),
                                                         ('Пазлы', 9, false);

-- Вставка подкатегорий для Животные
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Собаки', 10, false),
                                                         ('Кошки', 10, false),
                                                         ('Птицы', 10, false),
                                                         ('Рыбы', 10, false),
                                                         ('Грызуны', 10, false),
                                                         ('Корм', 10, false),
                                                         ('Аксессуары', 10, false),
                                                         ('Здоровье', 10, false),
                                                         ('Игрушки', 10, false),
                                                         ('Переноски', 10, false);

-- Вставка подкатегорий для Репетиторство
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Математика', 11, true),
                                                         ('Физика', 11, true),
                                                         ('Химия', 11, true),
                                                         ('Английский язык', 11, true),
                                                         ('Программирование', 11, true),
                                                         ('Музыка', 11, true),
                                                         ('Живопись', 11, true),
                                                         ('Подготовка к школе', 11, true),
                                                         ('Русский язык', 11, true),
                                                         ('История', 11, true);

-- Вставка подкатегорий для Образовательные услуги
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Курсы', 12, true),
                                                         ('Семинары', 12, true),
                                                         ('Тренинги', 12, true),
                                                         ('Мастер-классы', 12, true),
                                                         ('Вебинары', 12, true),
                                                         ('Консультации', 12, true),
                                                         ('Тестирование', 12, true),
                                                         ('Подготовка документов', 12, true),
                                                         ('Языковые курсы', 12, true),
                                                         ('Профориентация', 12, true);

-- Вставка подкатегорий для Бытовые услуги
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Уборка', 13, true),
                                                         ('Стирка и глажка', 13, true),
                                                         ('Приготовление еды', 13, true),
                                                         ('Уход за детьми', 13, true),
                                                         ('Уход за животными', 13, true),
                                                         ('Доставка', 13, true),
                                                         ('Вывоз мусора', 13, true),
                                                         ('Химчистка', 13, true),
                                                         ('Ремонт одежды', 13, true),
                                                         ('Уход за растениями', 13, true);

-- Вставка подкатегорий для Ремонт и строительство
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Электрика', 14, true),
                                                         ('Сантехника', 14, true),
                                                         ('Отделочные работы', 14, true),
                                                         ('Мебель на заказ', 14, true),
                                                         ('Ремонт техники', 14, true),
                                                         ('Строительство', 14, true),
                                                         ('Дизайн', 14, true),
                                                         ('Проектирование', 14, true),
                                                         ('Ремонт мебели', 14, true),
                                                         ('Установка оборудования', 14, true);

-- Вставка подкатегорий для Красота и уход
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Парикмахерские', 15, true),
                                                         ('Косметология', 15, true),
                                                         ('Маникюр', 15, true),
                                                         ('Педикюр', 15, true),
                                                         ('Массаж', 15, true),
                                                         ('СПА', 15, true),
                                                         ('Тату', 15, true),
                                                         ('Визаж', 15, true),
                                                         ('Брови', 15, true),
                                                         ('Ресницы', 15, true);

-- Вставка подкатегорий для Транспортные услуги
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Такси', 16, true),
                                                         ('Грузоперевозки', 16, true),
                                                         ('Аренда авто', 16, true),
                                                         ('Эвакуатор', 16, true),
                                                         ('Доставка', 16, true),
                                                         ('Переезд', 16, true),
                                                         ('Курьерские', 16, true),
                                                         ('Туристические', 16, true),
                                                         ('Междугородние', 16, true),
                                                         ('Международные', 16, true);

-- Вставка подкатегорий для IT и компьютерные услуги
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Ремонт техники', 17, true),
                                                         ('Программирование', 17, true),
                                                         ('Дизайн', 17, true),
                                                         ('Администрирование', 17, true),
                                                         ('Консультации', 17, true),
                                                         ('Обучение', 17, true),
                                                         ('Создание сайтов', 17, true),
                                                         ('SEO', 17, true),
                                                         ('Техподдержка', 17, true),
                                                         ('Настройка', 17, true);

-- Вставка подкатегорий для Мероприятия и развлечения
INSERT INTO categories (name, parent_id, is_service) VALUES
                                                         ('Организация праздников', 18, true),
                                                         ('Аниматоры', 18, true),
                                                         ('Фотографы', 18, true),
                                                         ('Видеографы', 18, true),
                                                         ('Музыка', 18, true),
                                                         ('Кейтеринг', 18, true),
                                                         ('Декор', 18, true),
                                                         ('Шоу-программы', 18, true),
                                                         ('Квесты', 18, true),
                                                         ('Экскурсии', 18, true);



-- Вставка тегов (только для товаров)
INSERT INTO tags (name) VALUES
                            ('Бренд'),
                            ('Цвет'),
                            ('Материал'),
                            ('Состояние'),
                            ('Гарантия'),
                            ('Страна производства'),
                            ('Сезон'),
                            ('Стиль'),

-- Вставка значений для тега Бренд
INSERT INTO tag_values (tag_id, value) VALUES
                                           (1, 'Apple'), (1, 'Samsung'), (1, 'Xiaomi'), (1, 'Sony'), (1, 'LG'),
                                           (1, 'Nike'), (1, 'Adidas'), (1, 'Zara'), (1, 'H&M'), (1, 'Bosch'),
                                           (1, 'Philips'), (1, 'Canon'), (1, 'Nikon'), (1, 'Lenovo'), (1, 'HP'),
                                           (1, 'Dell'), (1, 'Asus'), (1, 'Microsoft'), (1, 'Intel'), (1, 'AMD');

-- Вставка значений для тега Цвет
INSERT INTO tag_values (tag_id, value) VALUES
                                           (2, 'Черный'), (2, 'Белый'), (2, 'Серый'), (2, 'Красный'), (2, 'Синий'),
                                           (2, 'Зеленый'), (2, 'Желтый'), (2, 'Оранжевый'), (2, 'Фиолетовый'), (2, 'Розовый'),
                                           (2, 'Коричневый'), (2, 'Бежевый'), (2, 'Голубой'), (2, 'Серебристый'), (2, 'Золотой'),
                                           (2, 'Хаки'), (2, 'Бордовый'), (2, 'Бирюзовый'), (2, 'Сиреневый'), (2, 'Мятный');

-- Вставка значений для тега Материал
INSERT INTO tag_values (tag_id, value) VALUES
                                           (3, 'Пластик'), (3, 'Металл'), (3, 'Стекло'), (3, 'Дерево'), (3, 'Керамика'),
                                           (3, 'Хлопок'), (3, 'Шерсть'), (3, 'Лен'), (3, 'Шелк'), (3, 'Кожа'),
                                           (3, 'Замша'), (3, 'Джинса'), (3, 'Флис'), (3, 'Нейлон'), (3, 'Полиэстер'),
                                           (3, 'Резина'), (3, 'Бумага'), (3, 'Картон'), (3, 'Акрил'), (3, 'Велюр');


-- Вставка значений для тега Состояние
INSERT INTO tag_values (tag_id, value) VALUES
                                           (5, 'Новое'), (5, 'Б/у отличное'), (5, 'Б/у хорошее'), (5, 'Б/у удовлетворительное'),
                                           (5, 'Требует ремонта'), (5, 'На запчасти'), (5, 'Следы использования'), (5, 'Как новое'),
                                           (5, 'Распакованное'), (5, 'С дефектами'), (5, 'После ремонта'), (5, 'В оригинальной упаковке'),
                                           (5, 'С гарантией'), (5, 'Без гарантии'), (5, 'С чеком'), (5, 'Без чека'),
                                           (5, 'С инструкцией'), (5, 'Без инструкции'), (5, 'С аксессуарами'), (5, 'Без аксессуаров');

-- Вставка значений для тега Гарантия
INSERT INTO tag_values (tag_id, value) VALUES
                                           (6, '1 месяц'), (6, '3 месяца'), (6, '6 месяцев'), (6, '1 год'), (6, '2 года'),
                                           (6, '3 года'), (6, '5 лет'), (6, 'Пожизненная'), (6, 'Официальная гарантия'), (6, 'Гарантия магазина'),
                                           (6, 'Гарантия производителя'), (6, 'Без гарантии'), (6, 'Гарантия 30 дней'), (6, 'Гарантия 14 дней'),
                                           (6, 'Расширенная гарантия'), (6, 'Международная гарантия'), (6, 'Локальная гарантия'), (6, 'Сервисное обслуживание'),
                                           (6, 'Техническая поддержка'), (6, 'Обмен в течение 14 дней');

-- Вставка значений для тега Страна производства
INSERT INTO tag_values (tag_id, value) VALUES
                                           (7, 'Россия'), (7, 'Китай'), (7, 'США'), (7, 'Германия'), (7, 'Япония'),
                                           (7, 'Корея'), (7, 'Тайвань'), (7, 'Вьетнам'), (7, 'Индия'), (7, 'Турция'),
                                           (7, 'Италия'), (7, 'Франция'), (7, 'Великобритания'), (7, 'Польша'), (7, 'Чехия'),
                                           (7, 'Беларусь'), (7, 'Казахстан'), (7, 'Малайзия'), (7, 'Таиланд'), (7, 'Бразилия');

-- Вставка значений для тега Сезон
INSERT INTO tag_values (tag_id, value) VALUES
                                           (8, 'Весна'), (8, 'Лето'), (8, 'Осень'), (8, 'Зима'), (8, 'Демисезон'),
                                           (8, 'Круглогодичный'), (8, 'Весна-Лето'), (8, 'Осень-Зима'), (8, 'Пляжный'), (8, 'Горнолыжный'),
                                           (8, 'Летний'), (8, 'Зимний'), (8, 'Осенний'), (8, 'Весенний'), (8, 'Всесезонный'),
                                           (8, 'Специальный'), (8, 'Праздничный'), (8, 'Свадебный'), (8, 'Спортивный'), (8, 'Повседневный');


-- Вставка значений для тега Стиль
INSERT INTO tag_values (tag_id, value) VALUES
                                           (11, 'Классический'), (11, 'Современный'), (11, 'Минимализм'), (11, 'Хай-тек'), (11, 'Винтаж'),
                                           (11, 'Ретро'), (11, 'Прованс'), (11, 'Лофт'), (11, 'Скандинавский'), (11, 'Кантри'),
                                           (11, 'Бохо'), (11, 'Гранж'), (11, 'Спортивный'), (11, 'Деловой'), (11, 'Повседневный'),
                                           (11, 'Вечерний'), (11, 'Праздничный'), (11, 'Этнический'), (11, 'Морской'), (11, 'Военный');
